<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class resultSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            ['code'=>'ISTJ',
            'name' => 'حسی درون گرا با متفکر برون گرا',
            'paragraph' => 'رضایت شغلی تیپ های ISTJ با انجام کارهایی با شرایط زیر حاصل میشود.
1 - ماهیت فنی داشته باشد و به فرد امکان دهد که از توانمندیهایش استفاده کند.
2 - محصول یا خدمتی واقعی ارائه دهد و ترجیحا از روشهای استاندارد در آن استفاده شود.
3 - بتواند مستقل عمل کند و برای تکمیل آن از نیروی عالی تمرکز خود استفاده نماید.
4 - بتواند کار را در محیطی با ثبات و سنتی انجام دهد و ریسکهای غیر ضروری نیاز نباشد.- دارای نتایج ملموس و قابل اندازه گیری باشد.
6 - دارای هدفهای عینی روشن و ساختار سازمانی مشخص و تعریف شده باشد.
7 - فرد فرصت کافی برای آماده کردن خود داشته باشد.
8 - به فرد مسئولیتهای بیش از پیش و فزاینده بدهد.
9 - کار در محیطی انجام شود که به داوری و تجربههای فرد بهای کافی داده شود.
10 - به فرد امکان بدهد که به هدفهای تعیین شده برسد و نتایج کافی را در اختیار فرد قرار دهد.',
            'jobs' => serialize(['تجارت و بازرگانی','فروش و خدمات','امور مالی','تحصیلات و آموزش','حقوقی تکنولوژی','مراقبتهای بهداشتی']) ],
            ['code'=>'ISFJ',
                'name' => 'حسی درون گرا با احساسی برون گرا',
                'paragraph' => 'رضایت شغلی تیپ های ISFJ با انجام کارهایی با شرایط زیر حاص ل میشود.
1 - نیازمند مشاهده و دقت باشد، تا فرد با توانمندی خود بتواند به حقایق و جزئیات آن توجه کند.
2 - به فرد امکان دهد روی پروژههای ملموس کار کند و به دیگران کمک کند.
3 - به فرد امکان ابراز محبت را بدهد و شرایط پی بردن دیگران به تلاش او را فراهم سازد.
4 - به شکل سنتی و در محیطی سازمان یافته انجام شود.
5 - شرایطی فراهم سازد که فرد به روشهای استاندارد توجه کرده و از داوریهای عملی استفاده کند.
6 - به فرد امکان دهد که در هر لحظه روی یک پروژه یا یک شخص کار کند.
7 - به فرد فضای کاری خصوصی بدهد تا بتواند به تنهایی کار کند.
8 - بتواند به دیگران کمک کند و یا با کسانی کار کند که در باورها و ارزشهای او سهیم باشند.
9 - - شرایطی فراهم سازد که فرد سازمان یافته و کارآمد شود.
10 - لازم نباشد که فرد کارش را مرتب در حضور دیگران ارائه دهد.',
                'jobs' => serialize(['مراقبتهای درمانی و بهداشتی','تجارت خدمات','کارهای خلاق فن ی','خدمات اجتماعی آموزش ی'])],

            ['code'=>'ESTP',
                'name' => 'حسی برون گرا با متفکر درون گر',
                'paragraph' => 'رضایت شغلی تیپهای ESTP با انجام کارهایی با شرایط زیر حاصل میشود.
1 - بتواند با دیگران در ارتباط باشد، هر روز با موقعیت جدیدی روبرو شود و سرگرمی داشته باشد.
2 - بتواند از قدرت مشاهده و توجه خود برای کسب اطلاعات و حفظ آنها استفاده کند.
3 - بتواند برای مسایل و مشکلات راه حلهایی پیدا کند.
4 - کار پویا ، پر ماجرا و تفریحی باشد که در ان حوادث به سرعت اتفاق بیفتد و فرد بتواند تصمیمگیری کند.
5 - بتواند در موقعیتهای برنامه ریزی نشده از روشهای غیر متعارف استفاده کند و به راه حلهای منطقی برسد.
6 - بتواند در شرایطی که مقررات وجود ندارد کار کند و با همکارانی شاداب و فعال سرو کار داشته باشد.
7 - شخصا اقدام به سازماندهی کند و لزوما مطابق معیارها و استانداردهای دیگران رفتار نکند.
8 - علمی و منطقی باشد و فرد بتواند از توانمندیهای استدلالی و عقلی خود استفاده کند.
9 - بتواند آزادانه با بحرانها روبرو شود.
10 - با واقعیتها سروکار داشته باشد نه با نظریههای مجرد، تا فرد بتواند با تلاش هایش به نتایج ملموس برسد.',
                'jobs' =>serialize([ 'تجارت و بازرگان ی','فروش خدما ت','امور مال ی','تجارت کارهای دست ی','سرگرم ی ورز ش'])],

            ['code'=>'ESFP',
                'name' => 'حسی برون گرا با احساسی درون گر ا',
                'paragraph' => '- امکان یادگیری از تجارب را فراهم سازد ، تا اطلاعات لازم را جمعآوری و به حل مسئله اقدام نماید.
2 - امکان دخالت شخص در مسایل را فراهم سازد ، تا بتواند با مشتریان و مراجعان مستقیما صحبت کند.
3 - فرد در کارش تفریح و استقلال داشته باشد و بتواند با اشخاص مختلفی سروکار داشته باشد.
4 - بتواند با مهارت با اشخاص و با مشکلات آنها روبرو شود و از تنش آنها بکاهد.
5 - امکان فعالیتهای مختلف وجود داشته باشد.
6 -بتواند در طول روز با اشخاص مختلفی که شور و اشتیاق او را دارند، همکاری کند.
7 - بتواند به پروژههای که زودبازده هستند بپردازد و نیازهای اشخاص مختلف را برآورده سازد.
8 - امکان کار کردن در محیطی آرام و دوستانه فراهم باشد.
9 - تلاش بیشتر پاداش داشته باشد و فرد احساس کند به خاطر کارش از او قدردانی می شود.
10 - حداقل بوروکراسی در کار باشد و فرد از کارش لذت ببرد و خودش باشد.',
                'jobs' => serialize(['آموزش','خدمات اجتماع ی','سرگرمی تفریح ی','تجارت','فروش','مراقبتهای بهداشتی و سلامت ی ','خدما ت','علوم'])],

            ['code'=>'INTJ',
                'name' => 'شهودی درون گرا با متفکر برون گر ا',
                'paragraph' => '- به فرد امکان بدهد راه حلهای مبتکرانه حل مسایل را پیدا کند تا سیستمهای موجود را بهبود بخشد.
2 - امکان صرف انرژی در انجام ایدههای خوب را فراهم سازد، تا به شکل منطقی فعالیت داشته باشد.
3 - امکان کار کردن با اشخاصی را که فرد به تخصص، هوش و صلاحیت آنها احترام میگذارد، فراهم سازد.
4 - به فرد به خاطر نقطه نظرهایش اعتبار بدهد و امکان اجرای آ نها را فراهم سازد.
5 - امکان کار کردن مستقل را به فرد بدهد و بتواند با افراد آگاه تبادل نظر داشته باشد.
6 - فرد را در جریان اطلاعات جدید قرار دهد، تا بتواند بر توانمندیها و صلاحیتهای خود بیفزاید.
7 - به فرد امکان بدهد کار و تولیدی فراهم آورد که با معیارهای بالای او همخوانی داشته باشد.
8 - حالت تکراری نداشته باشد.
9 - به فرد استقلال و اختیار فراوان بدهد تا تغییراتی را ایجاد کرده و به رشد اشخاص و سیستمها کمک کند.
10 - همخوان با معیارهای بالا باشد و منصفانه زحمات فرد را جبران کند.',
                'jobs' => serialize(['تجار ت امور مال ی','مراقبتهای بهداشتی','پزشک ی','آموز ش تکنولوژ ی','رشتههای حرفه ای','فعالیتهای خلا ق'])],

            ['code'=>'INFJ',
                'name' => 'شهودی درون گرا با احساسی برون گر ا',
                'paragraph' => '- به فرد امکان بدهد روی ایدهها و نقطه نظرهایی کار کند که به رشد و تعالی دیگران کمک کند.
2 - به فرد امکان بدهد محصولات و خدماتی تولید کند که به آنها اعتقاد دارد و احساس افتخار میکند.
3 - به مالکیت فرد و تلاشهای منحصر به فردی که میتواند داشته باشد توجه کند و به آنها بها دهد.
4 - به فرد اجازه دهد که خود را ابراز کند و پنداره خود را ببیند.
5 - به فرد اجازه دهد از ایدههای خود برای یاری رساندن به دیگران استفاده کند.
6 - به فرد اجازه دهد تا بتواند کارش را در محیطی دوستانه و عاری از تنش انجام دهد.
7 - بتواند مستقل کار کند ، ولی نظراتش را در محیطی دوستانه با دیگران در میان بگذارد.
8 - به فرد امکان بدهد که اوقات و محیط کار خود را سازماندهی کند و روی جریان کار کنترل داشته باشد.- به فرد امکان ب دهد تا نقطه نظرهایش را جمع بندی و پردازش کند و در آمادگی مطلوب قرار بگیرد.
10 - با باورهای فرد هماهنگ باشد و به او امکان دهد از کمال شخصی و حرفهای خوب برخوردار باشد.',
                'jobs' => serialize(['مشاوره آموز ش','امور بازرگانی و تجارت ی','کارهای خلاق','مراقبتهای بهداشتی',' خدمات اجتماع ی','تکنولوژ ی','مذهب'])],

            ['code'=>'ENTP',
                'name' => 'شهودی برون گرا با متفکر درون گر ا',
                'paragraph' => '- به فرد امکان بدهد تا دست به اقدامات خلاق بزند و راه حل های جدید برای مسایل پیدا کند.
2 - بتواند راه حلهای خلاق خود را برای ایجاد سیستمهای عملکردی کاراتر مورد استفاده قرار دهد.
3 - خلاقیت فرد تایید و تشویق شود.
4 - به فرد امکان دهد موقعیتهای مختلفی را تجربه کند که پر از لذت و تفریح و هیجان باشد.
5 - از نظمی منطقی برخوردار باشد و از معیارها و استانداردهای منصفانه استفاده کند.
6 - به فرد امکان دهد تا با اشخاص مختلف بخصوص افراد محترم ملاقات و تبادل نظر داشته باشد.
7 - به فرد امکان بدهد تا تواناییهای شخصی و شغلی خود را بالا ببرد و بتواند با اشخاص توانمند مرتبط باشد.
8 - بتواند در شرایط دنیای متحول و متغیر، موثر واقع شود.
9 - بتواند در محیطی دوستانه و سازمان نیافته عمل کند. جایی که بتواند در آن آزادی عمل فراوان داشته باشد.
10 - به فرد امکان بدهد تا پروژههای نو طراحی کند، ولی مجبور نباشد به جزئیات مسایل بها بدهد.',
                'jobs' =>serialize( ['بازاریابی','امور بدیع و ابتکار ی','تجارت','کارفرمای ی برنامهریزی و توسع ه','مشاغل متفرق ه'])],

            ['code'=>'ENFP',
                'name' => 'شهودی برون گرا با احساسی درون گر ا',
                'paragraph' => '- به فرد امکان بدهد با گروههای متنوعی روی موضوعات مختلف کار کند.
2 - به فرد امکان بدهد تا ایدهها، خدمات یا راه حلهای نو برای مسایلی که به دیگران کمک میکند پیدا کند.
3 - خوشایند، چالش برانگیز و همیشه از تنوعی برخوردار باشد.
4 - به ندرت لازم باشد که فرد در جزئیات کار شرکت کند.
5 - به فرد امکان دهد به سرعت روی موضوعات کار کند،آزادی عمل داشته باشد تا ارادهاش را نشان دهد.
6 - به فرد امکان دهد تا با اشخاص جدیدی آشنا شود، مهارتهای جدیدی بیاموزد و کنجکاوی خود را ارضا کند.
7 - با ارزشهای فرد سازگار باشد، به او امکان دهد فرصتهای مناسب به سود دیگران فراهم آورد.
8 - بتواند کار را در محیطی دوستانه و آرام انجام دهد و با دیگران در شرایط حداقل تعارض باشد.
9 - به فرد امکان بدهد تا از الهامات خود تبعیت کند و در کارهای جالب و هیجان بخش مشارکت کند.
10 - کار در فضایی انجام شود که تشکر به همراه داشته باشد و به شور و شوق و خلاقیت فرد بیافزاید.',
                'jobs' => serialize(['بازاریابی','برنامه ریز ی','آموزش مشاور ه','کارفرمای ی ','تجارت','مراقبتهای بهداشتی خدمات اجتماع ی','تکنولوژ ی','کارهای خلاق'])],

            ['code'=>'ISTP',
                'name' => 'متفکر درون گرا با حسی برون گر ا',
                'paragraph' => '- بتواند منابعی را شناسایی و به کاراترین شکل ممکن از آنها بهره برداری کند.
2 - به فرد امکان بدهد مهارتهایی را بیاموزد تا بتواند در آنها به استادی برسد و از آنها استفاده نماید.
3 - به فرد امکان بدهد تا از علمی که کسب کرده استفاده نماید و با آن مشکلات دیگران را حل کند.
4 - دارای جهات روشن و واضح باشد و فرد بتواند با محصولات واقعی در تماس باشد.- تفریحی و پویا باشد تا فرصت داشته باشد که از محیط بسته کار خارج شود و قدمی در دل طبیعت بگذارد.
6 - در محیطی که عاری از مقررات مفصل و دست و پا گیر است، کار کند.
7 - بتواند مستقل کار کند و نظارت دیگران روی او حداقل و نظارت او هم روی دیگران کم باشد.
8 - به فرد فرصت کافی بدهد تا به علایق و سرگرمیهایش برسد.
9 - به فرد شادی و لذت بدهد و پیوسته چالش دار باشد.
10 - بی نیاز از کارهای روزمره با مقررات زیاد باشد.',
                'jobs' => serialize(['خدمات بهداشتی و درمان ی','امور مال ی تجارت','فروش خدما ت','تجارت کارهای دست ی','تکنولوژ ی'])],

            ['code'=>'INTP',
                'name' => 'متفکر درون گرا با شهودی برون گر ا',
                'paragraph' => '- به فرد اجازه دهد ایدههای جدیدی ارائه دهد و آنها را نقد و تحلیل کند.
2 - به فرد امکان بدهد انرژی خود را در جریان خلاقیت به کار گیرد و صرفا به نتیجه کار نظر نداشته باشد.
3 - به فرد فرصت دهد تا مستقل کار کند. وقت کافی داشته باشد که بطور خصوصی کارهایش را انجام دهد.
4 - با مسایل پیچیده رو به رو باشد تا خارج از روشهای متعارف فرد را به چالش برانگیزد.
5 - بتواند با انعطاف کافی انجام دهد وقواعد بی موعد سدی در برابر وی ایجاد نکند.
6 - به فرد امکان دهد تا از استانداردها و معیارهای خود در کارها استفاده کند.
7 - به فرد امکان دهد با گروه کوچک اما واجد شرایط و با صلاحیت کارها را انجام دهد.
8 - به فرد امکان دهد تا ایده های خلاق ارائه دهد و انجام کارها را به دیگران محول کند.
9 - به فرد امکان دهد که شایستگیهای خود را افزایش دهد و با اشخاص با صلاحیت در تماس باشد.
10 - نیازی به این نداشته باشد که مستقیما اوقات خود را صرف ساز ماندهی سایرین بکند.',
                'jobs' => serialize(['مراقبتهای بهداشتی ','فن ی حرفهای','تجار ی','کارهای خلاق','کامپیوت ر تکنولوژ ی'])],

            ['code'=>'ESTJ',
                'name' => 'متفکر برون گرا با حسی درون گر ا',
                'paragraph' => '- به فرد امکان دهد سازمان یافته کار کند و از وقت خود به شکل موثر در رسیدن به نتیجه منطقی استفاده کند.
2 - به فرد امکان بدهد تا از مهارت هایش استفاده کند و از قدرت فکری و استدلالی خود سود جوید.
3 - دستاوردهای کار به شکلی منطقی قابل اندازه گیری باشد.
4 - در محیطی دوستانه انجام شود و همکارانی سخت کوش و با وجدان داشته باشد.
5 - بتوان از آن انتظارات روشن داشت.
6 - ماهیتی واقع بینانه ‚ ملموس و کاربردهای عملی داشته باشد و نتایج شخصی بر جای بگذارد.
7 - به فرد امکان دهد که مولد و کارا باشد ، بتواند اقدامات لازم را سازماندهی کند، از روشها و اصول شخصی پیروی کند. ضرب الاجلهای
مشخص داشته باشد تا فرد بتواند در زمان تعیین شده کارش را انجام دهد.
8 - بتواند در محیط و شرایط قابل پیش بینی کار کند.
9 - بتواند کار را با اشخاص دیگری انجام دهد. به فرد امکان دهد تا برخود و همکاران مسلط باشد.
10 - به فرد امکان تصمیمگیری بدهد تا بتواند مسئولیتهای فراوان بر عهده بگیرد و کار را کنترل بکند.',
                'jobs' =>serialize([ 'فروش و خدما ت','تکنولوژ ی','فیزیکا ل','مدیری ت','کارهای حرفها ی'])],

            ['code'=>'ENTJ',
                'name' => 'متفکر برون گرا با شهودی درون گر ا',
                'paragraph' => '- به فرد امکان رهبری بدهد تا کنترل امور دستش باشد.
2 - به فرد امکان برنامه ریزی بلند مدت را بدهد تا بتواند روشهای ابتکاری برای حل مسایل ارائه دهد.
3 - کار در محیطی سازمان یافته انجام شود تا فرد بتواند در محدودهای معین با دیگران کار کند.
4 - کنجکاوی ذهنی فرد را سبب شود و به او امکان دهد با مسایل پیچیده و اغلب دشوار کار کند.
5 - به فرد فرصت دهد با اشخاص لایق و توانمند کار کند.
6 - به فرد امکان دهد در محدوده سازمان رشد کند و بر صلاحیتهای خویش بیفزاید.
7 - جالب، چالش برانگیز و رقابت آمیز باشد، تا حدی که موفقیت،های فرد را دیگران ببینند.
8 - به فرد امکان بدهد با اشخاص هوشمند، خلاق و هدفمند کار کند.
9 - به فرد امکان هدف گذاری بدهد و شرایطی فراهم سازد که با دیگران به هدف اصلی سازمان فکر کنند.
10 - به فرد امکان دهد که دیگران را مدیریت کند. از معیارهای منطقی استفاده کند و از توانمندیهای دیگران بهره بگیرد.',
                'jobs' => serialize(['تجارت و بازرگان ی','امور مال ی','مشاوره','آموز ش','امور حرفها ی','تکنولوژ ی'])],

            ['code'=>'ISFP',
                'name' => 'احساسی درون گرا با حسی برون گر ا',
                'paragraph' => '- با ارزشهای فرد همخوانی داشته باشد.
2 - بتواند آن را در محیطی حمایتگرانه به اتفاق دیگران انجام دهد.
3 - به جزئیات توجه داشته باشد.
4 - به فرد فرصت دهد مستقل کار کند و در کنارش اشخاصی باشند که با او سازگار باشند.
5 - بتواند سازگار باشد، خود را تطبیق دهد و نتایج کار را تجربه کند.
6 - به فرد امکان دهد که از سلیقه خودش استفاده کند.
7 - کار در محیطی شاداب و با همکاری دیگران انجام شود.
8 - به فرد امکان بدهد تا به رشد درونی برسد.
9 - بتواند به سرعت به مسایل رسیدگی کند.
10 - مجبور نباشد پیوسته برای دیگران سخنرانی کند.',
                'jobs' =>serialize([ 'کارهای دستی و هنر ی','مراقبتهای بهداشت ی','علوم فن ی','فروش','خدما ت'])],

            ['code'=>'INFP',
                'name' => 'احساسی درون گرا با شهودی برون گر ا',
                'paragraph' => '- با ارزشها و باورهای فرد هماهنگ باشد و به فرد امکان دهد تا پنداره خود را ابراز دارد.
2 - به فرد فرصت دهد که روی جریان و نتیجه کارش کنترل داشت ه باشد.
3 - بتواند کارش را مستقل و خود مختار انجام دهد. کسی مزاحم کارش نشود و در مواقعی بتواند کارش را به کسانی که احساس میکند به او
احترام میگذارند ارائه دهد.
4 - بتواند بطور انعطاف پذیر و با حداقل مقررات و هر وقت احساس راحتی داشت کارش را انجام دهد.
5 - بتواند آن را با افراد با علاقه و خلاق انجام دهد ، ترجیح میدهد آن را بدون تنش با دیگران انجام دهد.- بتواند با انجام دادن آن رشد شخصی خود را تشویق کند.
7 - لازم نباشد کار را مرتب به دیگری ارائه دهد یا اینکه قبل از اتمام آن را به دیگران عرضه کند.
8 - به فرد امکان بدهد که از طریق آن به رشد دیگران کمک کند تا به حداکثر توانمندی خود برسد.
9 - لازم باشد که دیگران را درک کند و امکان دهد با اشخاص به طور انفرادی رابطه ایجاد کند.
10 - به فرد امکان دهد برای دسترسی به ایدهآلهایش تلاش کند و تحت تاثیر مشکلات متوقف نشود.',
                'jobs' =>serialize([ 'خلاق هنری','آموزش مشاور ه','زمینههای مذهب ی','مراقبتهای بهداشت ی','متخصص علوم اخلاقی','توسعه سازمان ی','تکنولوژ ی'])],

            ['code'=>'ESFJ',
                'name' => 'احساسی برون گرا با حسی درون گر ا',
                'paragraph' => 'رضایت شغلی تیپهای ESFJ با انجام کارهایی با شرایط زیر حاصل میشود.
1 - به فرد امکان دهد با دیگران روابطی صمیمانه داشته باشد و بتواند به تغییر زندگی دیگران کمک کند.
2 - برای دیگران منافعی عملی داشته باشد و به فرد امک ان دهد که مهارتهای ضروری را بیاموزد.
3 - به فرد امکان اعمال کنترل بدهد، بتواند با دیگران کار کند و به آنها جهت رسیدن به اهداف کمک کند.
4 - انتظارات روشن و واضح داشته باشد و معیارها و ملاک های موجود در آن روشن باشد.
5 - در محیطی با حس همکاری مشترک صورت پذیرد. محیطی عاری از هر نوع تعارض.
6 - به فرد امکان دهد تا تصمیمگیری کند و از روشهای کارآمد استفاده کند.
7 - به فرد امکان دهد تا با دیگران تبادل نظر کند و نقشی در تصمیم گیریها داشته باشد.
8 - به فرد امکان بدهد تا کارش را سازماندهی کند و در این کار به اطرافیان هم کمک کند.
9 - در محیطی دوستانه انجام گیرد. کار فرد مورد تایید و از موفقیت او تعریف شود.
10 - با توجه به ساختارها و روشهای موجود انجام شود، و به بالا دست احترام گذاشته شود.',
                'jobs' => serialize(['مراقبتهای بهداشتی و پزشک ی','تحصیلات و آموز ش','کارهای کارمند ی','کسب و کار','تجار ت','خدمات اجتماعی ','مشاور ه فروش خدما ت'])],

            ['code'=>'ENFJ',
                'name' => 'احساسی برون گرا با شهودی درون گر ا',
                'paragraph' => '- به فرد امکان دهد با همکاران، مراجعان، مشتریان روابط گرم و متقابلی داشته باشد.
2 - به فرد امکان دهد راه حلهای خلاق برای پروژههایش پیدا کند و نتایج مثبت تلاشهایش را ببیند.
3 - کار در محیطی انجام شود که انتظارات در آن روشن باشد و رشد شخصی تشویق شود.
4 - به فرد اجازه دهد عضوی از تیم سایر اشخاصی باشد که فرد به آنها اعتقاد دارد.
5 - به فرد امکان دهد که راه حلهای خلاق برای مسایل پیدا کند و آنها را با اشخاص حمایتگر در میان بگذارد.
6 - فعالیت در محیطی چالش برانگیز انجام شود و به فرد امکان دهد در آن واحد در چند پروژه کار کند.
7 - به فرد امکان دهد تا از مهارتهای خود استفاده کند و روی پروژههای خود مسئولیت داشته باشد.
8 - به فرد انواع مختلفی از فعالیت ها را بدهد تا به شکلی منظم و برنامهریزی شده از آنها استفاده کن د.
9 - فرد را در معرض ایده های نو قرار دهد و به او امکان دهد تا روشهای نو را بیازماید و به خصوص به روشهایی توجه داشته باشد که زندگی
دیگران را بهبود بخشد.
10 - شغل فرد در محیطی باشد که از تعارض و تنش بین افراد به دور باشد.',
                'jobs' =>serialize( ['ارتباطا ت ','امور آموزش ی','خدمات انسان ی','مراقبتهای بهداشت ی','تکنولوژ ی','بازرگانی مشاور ه','مشاور ه'])],


        ];
        DB::table('result')->insert($data);
    }
}
