<x-layout>
    <div class="row container mt-4">
        <div class="col col-sm-8 offset-sm-3">
            <div class="card" >
                <div class="card-body">
                    <h5 class="card-title">تست تیپ شخصیتی مایرز بریگز</h5>
                    <p class="card-text">
                        اهمیت و کاربرد آزمون MBTI
                        این پرسشنامه توسط کاترین بریگز و ایزابل بریگز ساخته شده است و در جهت شناخت چگونگی ارضاء شخصیت و رضایت شغلی تلاش میکند
                        تا برخی از انواع مشاغل مناسب را معرفی کند بطوریکه چگونگی نگاه فرد به محیط و چگونگی تصمیمگیری او را نشان میدهد. درک او از
                        اولوی تها و ترجیحات خود و دیگران‚ او را در شناسایی توانمندیهایش یاری میکند. این درک و فهم به او بینشی نسبت به نوع کاری که از آن
                        لذت میبرد و در آن موفق است و چگونگی ارتباط او با دیگران که ترجیحات متفاوتی دارند، بدست میدهد. در واقع هدف از انجام این آزمون
                        این است که افراد، ویژگیهای شخصی خود را از جمله علاقهمندی ها، نقاط قوت، ضعف، اولویتهای شغلی احتمالی و سازگاری با افراد دیگر را
                        بیشتر کشف و درک کنند.
                        همچنین از جمله تاثیرات مهم آزمون MBTI میتوان به موارد ذیل اشاره نمود:
                    </p>
                    <ul class="list-group">
                        <li class="list-group-item"> شناخت بهتر خود و توسعه و پیشرفت فردی</li>
                        <li class="list-group-item">توسعه و پیشرفت شغلی</li>
                        <li class="list-group-item"> تشکیل گروهها و تیمهای کاری</li>
                        <li class="list-group-item">بالندگی سازمانی</li>
                        <li class="list-group-item"> آموزش رهبران و مدیران</li>
                        <li class="list-group-item">حل مسأله بین فردی و بین گروهی</li>
                        <li class="list-group-item">مشاوره ارتباطات بین فردی</li>
                    </ul>
                </div>
            </div>
        </div>

        <div class="col col-sm-8 mt-2 offset-sm-3">
            <div class="card">
                <div class="card-body">
                    <h5 class="card-title">نحوه انجام آزمونMBTI</h5>
                    <p class="card-text">
                        این آزمون دارای 87 سوال است که پاسخ دهندگان باید در هر سوال صرفا یکی از گزینه های الف یا ب را انتخاب نمایند ) هیچ پاسخ درست یا
                        غلطی وجود ندارد(. این آزمون محدودیت زمانی ندارد اما برای تکمیل پرسشنامه زمانی حدود 15 تا 25 دقیقه لازم میباشد. شایان ذکر است
                        نباید به پاسخ دهندگان تعاریفی از لغات یا عبارات ارائه کرد؛ فرد میبایست بر اساس درک شخصی خود به آن سوال پاسخ دهد. سوال میتواند
                        حذف شود اما فقط در صورتیکه پاسخ برای فرد امکان پذیر نباشد. دقت نمایید که درانجام این آزمون به خودتان فکر کنید؛ آن هم خارج از
                        نقشهای شغلی یا خانوادگیای که بر عهده دارید. به این صورت که معمولا کدام پاسخ یا عمل به شما نزدیکتر است، یا اینکه کدام پاسخ توصیف
                        نزدیکتری از اعمال و احساسات شما به دست میدهد.
                    </p>
                    <a href="/start" class="btn btn-success btn-lg">شروع تست</a>
                </div>
            </div>
        </div>

    </div>

</x-layout>

